scala/scala-yaasbite800/tutorial/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>README</title>
<!-- 2016-07-15 Fri 10:23 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Abbi" />
</head>
<body>
<div id="content">
<h1 class="title">README</h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Goal</h2>
<div class="outline-text-2" id="text-1">
<p>
In this Bite we want to <b>start using micro-services</b> that are available from the <a href="https://market.yaas.io/beta">Yaas Market Place</a>. In particular we will modify our persistence logic to use the Document Service, rather than in-memory logic with slick and h2. If you browse the <a href="https://market.yaas.io/beta">Yaas Market Place</a>, you will find the <a href="https://devportal.yaas.io/services/document/latest/index.html">Document Service</a> in the <a href="https://market.yaas.io/beta/all/Persistence-(Beta)/9b174e06-9283-4c47-8d16-6eded2ac840a">Persistence (Beta) Package</a>. Its documentation will tell you that callers to this service <b>require</b> 3 scopes to successfully invoke it: hybris.document<sub>view</sub>, hybris.document<sub>manage</sub>, and hybris.document<sub>admin</sub>.
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Changes needed in the Yaas Project and the microservice</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> in the new yaas project</h3>
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> subscribe to the <a href="https://market.yaas.io/beta/all/Persistence-(Beta)/9b174e06-9283-4c47-8d16-6eded2ac840a">Persistence (Beta) Package</a>, so that the API Proxy will (once we have a suitable access-token), allow us to call the Document Service</h4>
</div>
<div id="outline-container-sec-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> register our microservice in YaaS</h4>
</div>
<div id="outline-container-sec-2-1-3" class="outline-4">
<h4 id="sec-2-1-3"><span class="section-number-4">2.1.3</span> add a YaaS Client to our YaaS Service, that has the rights to request and be given the new scopes.</h4>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> add logic in the microservice to accquire <b>access-tokens</b> and invoke <b>Document Service</b></h3>
<div class="outline-text-3" id="text-2-2">
</div><div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> we will have 2 new classes</h4>
<div class="outline-text-4" id="text-2-2-1">
</div><ol class="org-ol"><li><a id="sec-2-2-1-1" name="sec-2-2-1-1"></a>services.DocServiceWrapper<br  /></li>
<li><a id="sec-2-2-1-2" name="sec-2-2-1-2"></a>services.OauthService<br  /></li></ol>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Steps</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> cd to project-directory <b>scala-yaasbite800</b></h3>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> adjust the name in the <b>manifest.yml</b> to make it unique</h3>
</div>
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Determine where the microervice will be deployed in the cloud: We need the location of our microservice in the cloud, but it is not yet ajusted and ready to be deployed.</h3>
<div class="outline-text-3" id="text-3-3">
</div><div id="outline-container-sec-3-3-1" class="outline-4">
<h4 id="sec-3-3-1"><span class="section-number-4">3.3.1</span> to get around this, we will skip running tests for now</h4>
</div>
<div id="outline-container-sec-3-3-2" class="outline-4">
<h4 id="sec-3-3-2"><span class="section-number-4">3.3.2</span> run the following commands</h4>
<div class="outline-text-4" id="text-3-3-2">
</div><ol class="org-ol"><li><a id="sec-3-3-2-1" name="sec-3-3-2-1"></a>activator dist<br  /></li>
<li><a id="sec-3-3-2-2" name="sec-3-3-2-2"></a>cf push<br  /></li>
<li><a id="sec-3-3-2-3" name="sec-3-3-2-3"></a><b>cf apps</b> take a note of the URL(1) to where the package has been deployed<br  /></li></ol>
</div>
</div>
<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> in your Yaas project</h3>
<div class="outline-text-3" id="text-3-4">
</div><div id="outline-container-sec-3-4-1" class="outline-4">
<h4 id="sec-3-4-1"><span class="section-number-4">3.4.1</span> Subscribe to the Persistence Package: Add a subscription to the <a href="https://market.yaas.io/beta/all/Persistence-(Beta)/9b174e06-9283-4c47-8d16-6eded2ac840a">Persistence (Beta) Package</a></h4>
</div>
<div id="outline-container-sec-3-4-2" class="outline-4">
<h4 id="sec-3-4-2"><span class="section-number-4">3.4.2</span> Wire the microservice into YaaS</h4>
<div class="outline-text-4" id="text-3-4-2">
</div><ol class="org-ol"><li><a id="sec-3-4-2-1" name="sec-3-4-2-1"></a>Create a new Service in the YaaS Builder and specify the deployed URL (1) in the service's Source URL field<br  /></li>
<li><a id="sec-3-4-2-2" name="sec-3-4-2-2"></a>Be sure you use the <b>https</b> prefix (protocol) in the Source URL field<br  /></li></ol>
</div>
<div id="outline-container-sec-3-4-3" class="outline-4">
<h4 id="sec-3-4-3"><span class="section-number-4">3.4.3</span> Add a YaaS Client to your YaaS Service, and add the three new scopes to its list of Required Scopes.</h4>
<div class="outline-text-4" id="text-3-4-3">
</div><ol class="org-ol"><li><a id="sec-3-4-3-1" name="sec-3-4-3-1"></a>This will allow us to use it's credentials to acquire access-tokens with those scopes<br  /></li></ol>
</div>
<div id="outline-container-sec-3-4-4" class="outline-4">
<h4 id="sec-3-4-4"><span class="section-number-4">3.4.4</span> Be sure to <b>deploy</b> the YaaS Service with the Deploy Button in the YaaS Service's page(it is not enough just to wire it up)</h4>
</div>
</div>
<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> change configurations</h3>
<div class="outline-text-3" id="text-3-5">
</div><div id="outline-container-sec-3-5-1" class="outline-4">
<h4 id="sec-3-5-1"><span class="section-number-4">3.5.1</span> In your Micro-service: Search for <b>NEEDS<sub>ADJUSTING</sub></b> and modify those entries to match your YaaS Project settings</h4>
</div>
</div>
<div id="outline-container-sec-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> try running the tests</h3>
<div class="outline-text-3" id="text-3-6">
</div><div id="outline-container-sec-3-6-1" class="outline-4">
<h4 id="sec-3-6-1"><span class="section-number-4">3.6.1</span> activator clean compile test</h4>
</div>
<div id="outline-container-sec-3-6-2" class="outline-4">
<h4 id="sec-3-6-2"><span class="section-number-4">3.6.2</span> If these pass, your service is succesfully calling the Deployent Service.</h4>
</div>
<div id="outline-container-sec-3-6-3" class="outline-4">
<h4 id="sec-3-6-3"><span class="section-number-4">3.6.3</span> Debug through the tests to find how the access-tokens are acquired, and how the document service is being called.</h4>
</div>
</div>
<div id="outline-container-sec-3-7" class="outline-3">
<h3 id="sec-3-7"><span class="section-number-3">3.7</span> Repackage and redeploy</h3>
<div class="outline-text-3" id="text-3-7">
</div><div id="outline-container-sec-3-7-1" class="outline-4">
<h4 id="sec-3-7-1"><span class="section-number-4">3.7.1</span> activator dist</h4>
</div>
<div id="outline-container-sec-3-7-2" class="outline-4">
<h4 id="sec-3-7-2"><span class="section-number-4">3.7.2</span> cf push</h4>
</div>
</div>
<div id="outline-container-sec-3-8" class="outline-3">
<h3 id="sec-3-8"><span class="section-number-3">3.8</span> Try hitting your website. You should see that the application works as before but is now using the Document Service for its persistence.</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Abbi</p>
<p class="date">Created: 2016-07-15 Fri 10:23</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
